Revit 2024 API
SubTransaction.GetStatus Method
 Returns the current status of the sub-transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public TransactionStatus GetStatus()
Visual Basic
Public Function GetStatus As TransactionStatus
Visual C++
public:
TransactionStatus GetStatus()
Return Value
 The current status of the sub-transaction.
See Also
SubTransaction Class
Autodesk.Revit.DB Namespace